{"pages":[{"tags":"pages","title":"About","text":"About Us Julian Rendell Owner MSc, Physics, and 15 year veteran of Software Development Julian is a life long maker who loves using his skills and experience in software development, electronics, and 3D printing to create unique and effective solutions to challenging problems. He is a Team Leader and collaborator who has experience guiding others and managing both financial and human resources. As an avid facilitator and presenter, He is comfortable leading and presenting to groups both large and small. He has a track record of taking the initiative and going out of my way to build partnerships. His experiences living and working in New Zealand, Japan, and Canada have included working for government, private, and public organizations, from the the small to the very large. This has left him with an appreciation for different viewpoints and a respect for diverse ways of thinking. This, combined with his ability to take in the big picture, has allowed him to effectively and successfully bridge the gaps between different groups and create inclusive ways forward. With a MSc in Physics and a keen interest in robotics, he has been interested in 3D printing since he saw one in a lab at university 20 years ago. He is excited to be bringing digital fabrication technologies to new audiences. Sarah Dakin Advisor MSc, Education, Elementary School Teacher Sarah's work in coaching and education weaves together in a life long interest in people and how we learn and grow. Sarah is interested in questions like the following: What gets people to say yes? How can new ideas be made sticky? What conditions lead to maximum learning? How do conversations become transformative? What makes it safe enough for someone to bear the vulnerability of trying something new? How can one person best facilitate another's growth? Sarah's passions include writing, speaking, education of the gifted, children with special needs and learning disabilities, math education, creativity and playfulness, self help and personal growth work including coaching, women in business, building strong communication skills, facilitation including Open Space Technology, The Art of Hosting, World Cafe, Appreciative Enquiry, Circle format meetings, the use of Web 2.0 technology in education.","url":"http://makeit.zone/about.html"},{"tags":"pages","title":"Classes","text":"Classes take-home-able adjective Easily and inexpensively repeatable in your own home. We strive to bring you fun, approachable, and take-home-able small group experiences! Many students are a little fearful of building with technology. To help them a plethora of wonderful learning tools have been created. For example, Lego® MindStorms®. However they are often expensive, and not something that people are willing to immediately invest in. Instead of using tools, we use our experience and knowledge to quickly build students confidence and competence beyond their initial trepidation. So that they can use less expensive items such as solder-less breadboards , Arduino and Raspberry Pi . These items are so inexpensive that students can have their own set at home and practice what they have learned. And practice is a key part of learning any new skill. We endeavor to ensure that everything we use in our classes can be easily sourced at reasonable prices, or is available locally as an inexpensive service. Children's Classes All of our classes are suitable for children 8+. Regular Classes Course Structure All courses listed below consist of eight weekly sessions. Sessions are one hour in length. Sessions consist of a mix of both directed and self-directed exploration of the topic at hand. Due to the small group setting, we can adjust the material to cater to each students needs. Rates Courses are all $160 for eight weekly sessions. Some courses have optional kits available for purchase. The purchase of these is not required for classes, but they do allow student to be able to take home their creations and continue exploring and developing their skills. Coming Soon! Design with Minecraft We'll explore using Minecraft as a tool to design 3D shapes. Students will: practice using Minecraft's advanced building tools use MCEdit to share their creations create an advanced Minecraft world with buildings and other structures that they can take home discover 3D scanning and scan themselves into their Minecraft world learn how to export parts of their world ready for 3D printing discover how 3D printers work Participants will have the opportunity to 3D print one of their creations! A Minecraft account is required. Join our mailing list to find out when classes start! Subscribe Coming Soon! Program with Minecraft We'll explore controlling Minecraft with the Python programming language. Learn how to: automatically create Minecraft structures draw amazing math-art use electronic sensors to control Minecraft use Minecraft to control robots This course teaches basic programming. it also covers basic geometry, and introduces students to electronics. A Minecraft account is required. Note: This class requires good reading ability. Join our mailing list to find out when classes start! Subscribe Coming Soon! Story Telling with Minecraft Create your own world and tell your stories! Students will use Minecraft to create the world of their story and props. They will add voices, sound-effects, and if they want, themselves using our green screen! We will cover: brainstorming ideas creating digital props in Minecraft basic camera motion voice recording video editing green screen recording A Minecraft account is required. Join our mailing list to find out when classes start! Subscribe Coming Soon! Robot Design Explore the mechanical design of robots and other machines! Students will explore mechanisms using simulation software and design their own mechanisms. They will then build them using popsicle sticks, paperclips, and other household items. The adventurous can add an electric motor and battery to make a self contained moving machine! Students will: learn how to use the Algodoo simulator discover basic mechanical designs build their own mechanisms how to use hobby electric motors and AA batteries Join our mailing list to find out when classes start! Subscribe Coming Soon! Control the World! Learn the basics of microcontrollers- little computers the size of your fingers! We'll show you the how to add sensors, control LED lights, buzzers, and hobby electric motors. You'll even discover how to make your own game control or joke keyboard! You'll learn: what a microcontroller is how to program one adding sensors controlling lights and motors making your own game controller, mouse, or keyboard Note: This class requires good reading ability. Join our mailing list to find out when classes start! Subscribe Future Courses These are just the beginning! Our goal is to foster a community of young creators and help them learn the skills they need to bring their ideas to life. Ideas for future classes include: wearable electronics (smart clothes and jewelry) basic electronics Computer Aided Design ( CAD ) more advanced electronics- from soldering to circuit board design Have an idea? Please let us know ! Vacation Camps Course Structure A week of creativity and making. We offer a combination of structured activities and free-play to engage students and keep things fun. Rates All camps run from 9am to 3pm, and cost $200 per student. Some courses have optional kits available for purchase. The purchase of these is not required for classes, but they do allow student to be able to take home their creations and continue exploring and developing their skills. Coming Soon! Design and Tell with Minecraft We'll explore using Minecraft as a tool to design 3D shapes and to tell stories! This camp combines and extends the content of our Design With Minecraft and Story Telling with Minecraft courses listed above. Participants will have the opportunity to 3D print one of their creations! A Minecraft account is required. Join our mailing list to find out when classes start! Subscribe Coming Soon! Program and Tell with Minecraft We'll explore controlling Minecraft with the Python programming language. Students will also create their own stories and create Minecraft themed videos. This camp combines and extends the content of our Program With Minecraft and Story Telling with Minecraft courses listed above. Note: This class requires good reading ability. A Minecraft account is required. Join our mailing list to find out when classes start! Subscribe Coming Soon! Maker Camp A little bit of everything! We'll have all our resources available to students and let them self-design their own projects for the week. A Minecraft account is required for Minecraft based activities. Join our mailing list to find out when classes start! Subscribe Adult Classes Course Structure Small group sessions tailored to the needs and goals of the students. Sessions are typically one hour per week. Individual tuition is also available on request. Rates Small group sessions are charged at $25 per session. Individual tutoring is typically $50 per hour. Get informed about upcoming classes by joining our mail list: Subscribe Intro to the Autodesk 123D Suite Need a replacement part for around the house? Or have an idea for a new mechanism? Come and learn the basics of Computer Aided Design ( CAD ) for 3D printed parts and start making your ideas real! We will explore some of AutoDesk's free 123D programs. Participants must attend all five sessions. Join Instructor Julian Rendell on Thursdays from 7-8pm in the Launchpad. Laptops will be available. Topics covered: Creating objects in 123D Design Using Meshmixer to prepare models for printing Overview of 123D Make Up Coming Sessions May 5-June 1 Free! Weekly on Thursdays at 7pm, Presented in association with the Richmond Public Library. Register here. Future Courses These are just the beginning! Our goal is to foster a community offer creators and help them learn the skills they need to bring their ideas to life. Ideas for future classes include: wearable electronics (smart clothes and jewelry) basic electronics Computer Aided Design ( CAD ) more advanced electronics- from soldering to circuit board design Have an idea? Please let us know !","url":"http://makeit.zone/classes.html"},{"tags":"pages","title":"Contact","text":"Contact Us Real Time Messaging You can reach us on these real-time chat networks: Smooch Facebook Messenger: click on the ‘Messages' tab on the Facebook plugin over there on the right. Phone Call us at: 604- AT - DNA - ZZ ( 604-283-6299 ). EMail You can email us at info@makeit.zone . And Join our mailing list to be informed of upcoming events and classes: Subscribe","url":"http://makeit.zone/contact.html"},{"tags":"pages","title":"Feedback","text":"We Want to hear from You! Our goal is to serve you, the public of Rinchmond, and the greater Vancouver area. Your ideas and suggestions are really important to us. All feedback will be read, thought about, and when possible, added to our plans . You can send feedback at any time, from any page, by clicking on the smiley-faced-speech bubble that appears on the left. Or you can go to our user feedback forum , which should also appear below! We're using User Report . Thanks in advance, Julian On behalf of the MakeItZone team.","url":"http://makeit.zone/feedback.html"},{"tags":"pages","title":"Welcome!","text":"Welcome to MakeItZone The power of Ironman's workshop is here. Now. Let us show you how to use it. Learn more backgrounds.mysitemyway.com Ironman © Marvel ® STEAM Courses We use fun activities, like playing Minecraft, and add design, programming, and engineering. Our courses cover STEM (Science, Technology, Engineering and Math) topics and add Art: we're STEAM powered! Learn more Robson: Mace- Medieval City STEAM Courses Our courses go beyond the screen- robots, electronics, sensors and more! Learn more Mitch Altman, VoidWarranties Workshop for Kids, Antwerp, Belgium, Nov-2012 Adult Courses We have courses for adults too! Come learn about CAD and 3D printing, and discover how to take your ideas from concept to physical object! Learn more Cindy Ho, RPL LaunchPad 3D Printing Services We have two large-format printers that can print in a variety of materials and colors. They're ready to print your designs. Need help with a design, technical support, or other questions? We can help with that too. Learn more SparkFun A Makerspace for Richmond We're starting small, but have big dreams: to create a place to meet, learn, have fun, and create, with tools and support at the ready. Interested? Click here to learn more. Learn more Laura James Previous Next","url":"http://makeit.zone/index.html"},{"tags":"pages","title":"Plans","text":"(Not so secret) Plans Note: if you're looking for event and class times, check out our schedule! . Here's what we're doing and planning to do. We're using Trello . Clicking on items in the embedded page below will take you to our Plans Board . Got ideas- great! Please click on the smiley-faced-speech bubble on the left and let us know!","url":"http://makeit.zone/plans.html"},{"tags":"pages","title":"Schedule","text":"Here's our upcoming clases and events. You can subscribe to our calander with iCal using this address: https://calendar.google.com/calendar/ical/l927grtk3unr4uk49r05vqj4b8%40group.calendar.google.com/public/basic.ics Or see it as it's own web page . .responsiveCal { position: relative; padding-bottom: 75%; height: 0; overflow: hidden; } .responsiveCal iframe { position: absolute; top:0; left: 0; width: 100%; height: 100%; }","url":"http://makeit.zone/schedule.html"},{"tags":"pages","title":"Services","text":"Services We offer the following services 3D Printing 3D Design 3D CAD / CAM and STEAM Education 3D Printing, Design, IT , and Educational Consultation 3D Printing We have two Lulzbot Taz printers that are ready to print your designs! These are great machines that offer larger-than average build volumes: approximately 25cm x 25cm x 23cm. We regularly print in PLA , PET -G, and ABS and can configure our machines to meet your needs- be it speed of service, strength, or finish quality. All our machines have been upgraded with all-metal hotends. This means we can also print with more exotic materials such as polycarbonate and nylon. We also plan to support printing in flexible materials in the near future. To start printing your design just contact us directly, or Order a 3D Print !function(a,b,c,d){var e,g=(a.getElementsByTagName(b)[0],/&#94;http:/.test(a.location)?\"http\":\"https\");a.getElementById(d)||(e=a.createElement(b),e.id=d,e.src=g+\"://d3d4ig4df637nj.cloudfront.net/w/2.0.js\",e.async=!0,a.body.appendChild(e))}(document,\"script\",1,\"h3d-widgets-js\"); from our Hub on 3D Hubs. 3D Design Have an idea but don't know how to use CAD programs? We can help. We have experience with AutoDesk 123D Design, AutoDesk 360 Fusion, as well as FreeCad and OpenSCAD. Working with you, we will create a CAD design that is optimized for 3D printing, and provide you with all the final design files. We can also help with existing designs that need tweaking for 3D printing- including mesh based designs created with tools such as Skulptris, MudBox, or Blender. Use our contact page to start the conversation today! 3D CAD / CAM and STEAM Education With experience teaching both individuals and small groups we can help you understand what 3D printing is, and how to leverage it to your advantage. We have courses that are suitable for adults and children, and always tailor them to your needs. Contact us today to find out more! Consultation Have a need that doesn't fit any of the above services? Then get in touch and let us craft a solution to your needs! Credits Background Video: LulzBot / Aleph Obects, Inc. Headquarters . Lulzbot is the manufacturer of our Taz printers. Taz Photo: SparkFun Flickr set","url":"http://makeit.zone/services.html"},{"tags":"pages","title":"Vision","text":"Early afternoon. People are leaving the MakeItZone carrying smiles, and interesting items- a stool, clothing that glows, a satchel. As many, of varying ages, are entering. There is a palpable energy and excitement in the air. bow-bee, Richmond bc sunset Enter to discover a tastefully furnished space with an inventive do-it-yourself flair. Move further inside… Paul Downey, Foyer …and discover classes on sewing, programming, and other skills taking place. Individuals and groups can be seen working on projects. Mitch Altman, VoidWarranties Workshop for Kids, Antwerp, Belgium, Nov-2012 Multiple generations. Inclusive of gender. People are discovering. Creating. Sharing. They are learning skills and learning about themselves. Children learning from elders and elders learning from children. The Maryland Science Center Go further. See tools, equipment, and materials. It is impossible to see it all and not imagine the things that might be built. By you. Laura James Welcome to MakeItZone. The place to make your dreams real, and to learn by doing. A safe and welcoming space for people with different skill sets and interests to meet, learn, and work on their projects. Building community. Building the future. Our plan is to create a for profit Makerspace here in Richmond, that is accessible to all ages, including elementary school children. What is a Makerspace? To describe them simply, makerspaces are community centers with tools. Makerspaces combine manufacturing equipment, community, and education for the purposes of enabling community members to design, prototype and create manufactured works that wouldn't be possible to create with the resources available to individuals working alone. These spaces can take the form of loosely-organized individuals sharing space and tools, for-profit companies, non-profit corporations, organizations affiliated with or hosted within schools, universities or libraries, and more. All are united in the purpose of providing access to equipment, community, and education, and all are unique in exactly how they are arranged to fit the purposes of the community they serve. from Makerspace.com This video does a great job of illustrating the concept: And this article has a lot of good information, from a librarian's point of view. Makerspaces (also known as Hackspaces) are becoming very popular. There are several across BC , including Vancouver ( VHS , MakerLabs ), North Vancouver ( Zen Maker Lab ), Surrey ( Maker Cube ), and Victoria ( Victoria Makerspace ). They've even be written about in the Georgia Straight . Richmond needs it's own Makerspace! Why for profit? We want to create a space that can provide well maintained and up-to-date equipment that supports individuals, groups, students and entrepreneurs. When you have a question or concern we want there to be a paid staff member on hand to provide answers, support, and suggestions. When? We are bootstrapping this by offering educational and skill-building courses. When they are providing enough revenue we will be in a position to find and rent space. How can I help? Enroll in a class, subscribe to our YouTube channel, support us on Patreon , give us feedback, or send us an email. We're also looking for (inexpensive!) space- please contact us if you can help! And if you have good condition equipment that you want to donate then we would be glad to talk with you. However please be aware that our storage space is very limited until we have a location.","url":"http://makeit.zone/vision.html"},{"tags":"Behind the Scenes","title":"Notes on This Website","text":"Introduction Wondering how this website has been put together? Or why certain things are as they are? Then this is the article for you! Like any project, it's good to be clear on the: what , why , and who . The how is (usually) less important; that's the journey (fun!) part, and likely to change as you go along. What : a business website, that also supports growing a community. Why : to attract the target market and engage them in the sales process. Who : parents looking for STEAM related courses for their children, adults looking for STEAM corses for themselves, and people looking for fabrication services. And a couple of hows : cheap hosting, and make the implementation (source code) available for people to learn from. These are less important. From there goals start to become clearer: works on computers, tablets, and phones includes social networks (Facebook, Twitter) tidy, clear layout has ‘sales' pages (more static), and ‘community' pages (blog posts, project writeups, etc) use plain web technologoies rather than a turn-key service like SquareSpace I don't like \"writing\" in html. To many tags to take care of/get in the way. Decisions Hosting GitHub . They provide free static file hosting, that's ok to use for commercial purposes Frameworks It's a waste of time managing links between your own html files, manaully updating files with style changes, etc. Luckily there are several static site generator tools that take care of this for you. Examples include Octopress and Pelican . I choose the later because it has the plugins I wanted, and I like python. Pelican also supports markdown - which is a great way of writing for the web (and other places too.) For layout ( CSS ), bootstrap can be added. This provides responsive layouts that will reshape themselves based on the screen size. Access to Source Code You can find the source code for this website on our Github page . Feel free to learn from or copy the engine (the javascript, html, css, python,… ) powering this site. But please don't just cut and copy the content (text, pictures, videos, etc)- thanks! Specific Tasks Parallax and Other Animations I wanted some (simple) animation on the home page. Parallax is effective, and not to hard to understand. I started with this Parallax with Jquery tutorial, and got that to work inside Pelican. But then I discovered ScrollMagic . Read the tutorials on their GitHub page. They're not complete, but there's enough there, along with their examples, to figure it out pretty quickly. Embedding YouTube Google makes it pretty easy: iFrame player . Problems arise when you try and embed it in a responsive design- where the size of the box the video is in can change after the page is loaded. I found this great article describing the problem, and a couple of solutions. I adapted the javascript solution. It needed some fixes (things change), and it worked really well… except when the window started small. I couldn't quickly see how to trigger the javascript that calculates the aspect ratio after Bootstrap has completed re-arranging the columns. Then I discovered Bootstrap's responsive embed . It's not as technically refined (doesn't handle non standard aspect ratios), but it works, and is really easy to use. Embedding Google Calendar Just go to the settings of a Google calendar and you'll find an option that will give you the html you need to embed it in your own web page. But it doesn't play nice with responsive layouts (noticing a theme?) An easy fix is documented here . Embedding a Twitter Timeline It's built in with Pelican/Pelican plugins. And the twitter widget is already responsive- horay! (Not surprising- Bootstrap is from Twitter!) BUT at the extreme, just before the columns re-arrange themselves, it ‘pops out' of my sidebar. It's only a little, but it's noticeable. In this case, a really fast hack: add overflow='scroll' to the containing div. The Twitter sidebar get's slightly truncated at the extreme, but it's still usable, and looks ok. Embedding a Facebook page I'm not a big fan of Facebook- but that's where a large section of our target market is. They make it very easy to include a Facebook page plugin . But it's explicitly not responsive(!) Attempt one at making it work in the sidebar lead to this article . It clearly describes what has to be done, and provides example javascript code. As I understand things after reading that article and parts of the Facebook javascript SDK docs , the layout is pre-calcuated server side. And you don't get regular HTML , but a Facebook XML data blob that has to be rendered by a script running in the browser. And that didn't work for me; I kept getting errors related to CORS . When the script I copied above from tried to reload the data from Facebook it was blocked. It may work if not hosted on localhost - but I couldn't find any concrete confirmation of this. But how does it work when the page is first loaded? My guess is that the Facebook javascript API loads and renders the data when it is loaded. The SDK code is being loaded from facebook.com, and CORS is setup so that it works. As soon as I call the Facebook SDK from my script, the origin is set as localhost . I tried turning off CORS in my browser, and that really blew up. Turns out this was used to hack peoples accounts . Attempt 2: I need to cause the data to be reloaded, but the script doing it has to be from an approved domain. And I don't want to be limited where my site is hosted for testing or deployment. Solution: Create a small wrapper html page that just contains the Facebook page plugin. Embed that in an iframe . Forcing the iframe to reload it's source after the page is resized causes the Facebook SDK to be reloaded- re-rendering the page plugin. Here's how to reload an iframe . It's wasteful and annoying- but it works. Hopefully browser caching makes it a little less horrible. Collecting Feedback - UserReport I wanted to make it easy for people to give feedback- corrections, ideas, whatever. I found UserReport . It's free and easy to setup. The only problem I had was figuring out how to adjust the location of the pop-up button; it defaults to vertically centered, on the left; right in the article text. I started going down the route of creating a custom feedback control … and then discovered you can change the position of the feeback button . I wish all the feeedback button related options where in one place, rather than in two. Live Messaging People like immediate feedback. We can remove a step (clicking and launching an email, waiting for a response) by adding live messaging to the site. The Facebook page plugin already includes this for Facebook messenger. The Twitter plugin sort-of does as well. But both of these don't make direct communication the main call to action . They really want you to look at the content they have and go to their websites. I added a direct \"talk to me\" call to action at the bottom of the page via smooch . They have a very reasonable free tier, and it was trivial to integrate. I've hooked it up to Slack . And if no one responds, then the viewer has the option of leaving their email for later follow up. Smooch can also be hooked up to SMS and voice calls, eg via Twilio . The only down-side was how the integration works in Slack : each incoming customer chat creates it's own chat room in slack . It makes sense, but it means Smooch has to have pretty wide access and control of your Slack team. My solution: create a new Slack team specifically for use with Smooch . This leaves the original Slack team ‘safer' for community use. References Here's a list of pages I found helpful. Pelican docs Pelican plugins using more than one Pelican theme tags vs categories Pelican bootstrap theme Fontawesome icon search Bootstrap CSS docs Jinja template engine docs jQuery selectors Bootstrap Navbar tutorial","url":"http://makeit.zone/notes-on-this-website.html"}]}